app/controllers/coins_controller.rb

  def show
    @coin = Coin.find_by(:id => params[:id])
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

  def create
    @coin = Coin.new(coin_params)
    if @coin.save
---
INSERT INTO "coins" ("id", "name", "value", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["id", 6], ["name", "Penny"], ["value", 1], ["amount", 4], ["created_at", "2020-03-16 18:48:05.117712"], ["updated_at", "2020-03-16 18:48:05.117712"]]

  def update
    @coin = Coin.find_by(:id => params[:id])
    @coin.update(coin_params)
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
UPDATE "coins" SET "amount" = $1, "updated_at" = $2 WHERE "coins"."id" = $3  [["amount", 6], ["updated_at", "2020-03-16 20:49:31.744653"], ["id", 6]]

  def destroy
    @coin = Coin.find_by(:id => params[:id])
    if @coin.destroy
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "coins" WHERE "coins"."id" = $1  [["id", 6]]