app/controllers/transactions_controller.rb

  def user_deposit
    #check by coin name, if possible make new deposit and increase the count of the amount.
    @coin = Coin.find(params[:coin_name])
---
SELECT "coins".* FROM "coins" WHERE "coins"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]