app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2020-03-16 13:59:05.619000"], ["updated_at", "2020-03-16 13:59:05.619000"]]
---
  def create
    @num = rand(10 ** 10)
    @user = User.create(api_key: @num)